In [1]:
import pandas as pd
import numpy as np

In [2]:
vendas_março={'Noroeste':30000,'Trocaphone':2000,'Tinoco':1500}

In [4]:
series_março=pd.Series(vendas_março)
series_março

Noroeste      30000
Trocaphone     2000
Tinoco         1500
dtype: int64

In [6]:
from numpy.random import randn
df=pd.DataFrame(randn(5,4),['A','B','C','D','E'],['W','X','Y','Z'])
df

          W         X         Y         Z
A -0.141254  1.182583 -0.028118 -1.387159
B -0.907615  1.999838  0.655333  1.507601
C -1.098725 -2.047806 -2.701401 -0.386646
D -1.339767  1.110071 -0.561657  0.950995
E  0.141305  0.185737  0.267917 -0.145637

In [9]:
df[['W']]

          W
A -0.141254
B -0.907615
C -1.098725
D -1.339767
E  0.141305

In [12]:
df.loc[['A','B'],['Y']]

          Y
A -0.028118
B  0.655333

In [13]:
df.iloc[:-1,:]

          W         X         Y         Z
A -0.141254  1.182583 -0.028118 -1.387159
B -0.907615  1.999838  0.655333  1.507601
C -1.098725 -2.047806 -2.701401 -0.386646
D -1.339767  1.110071 -0.561657  0.950995

In [14]:
df>0

       W      X      Y      Z
A  False   True  False  False
B  False   True   True   True
C  False  False  False  False
D  False   True  False   True
E   True   True   True  False

In [16]:
df

          W         X         Y         Z
A -0.141254  1.182583 -0.028118 -1.387159
B -0.907615  1.999838  0.655333  1.507601
C -1.098725 -2.047806 -2.701401 -0.386646
D -1.339767  1.110071 -0.561657  0.950995
E  0.141305  0.185737  0.267917 -0.145637

In [17]:
df['Y']>0

A    False
B     True
C    False
D    False
E     True
Name: Y, dtype: bool

In [18]:
df[df['Y']>0]

          W         X         Y         Z
B -0.907615  1.999838  0.655333  1.507601
E  0.141305  0.185737  0.267917 -0.145637

In [21]:
df[(df['Y']>0)& (df['X']>0)]

          W         X         Y         Z
B -0.907615  1.999838  0.655333  1.507601
E  0.141305  0.185737  0.267917 -0.145637

In [22]:
novo_index='PI SP RJ MG DF'.split()
df['Estados']=novo_index
df.set_index('Estados')

                W         X         Y         Z
Estados
PI      -0.141254  1.182583 -0.028118 -1.387159
SP      -0.907615  1.999838  0.655333  1.507601
RJ      -1.098725 -2.047806 -2.701401 -0.386646
MG      -1.339767  1.110071 -0.561657  0.950995
DF       0.141305  0.185737  0.267917 -0.145637

In [23]:
df.index

Index(['A', 'B', 'C', 'D', 'E'], dtype='object')

In [24]:
df['W'].sum()

-3.3460559399627643

In [27]:
data={'Classe':['júnior','júnior','Pleno','Pleno','Sênior','Sênior'],
      'Nome':['João','Maria','Pedro','Ana','Carlos','Mariana'],
      'Vendas':[200,120,340,124,243,350]}

In [28]:
desempenho=pd.DataFrame(data)
desempenho

   Classe     Nome  Vendas
0  júnior     João     200
1  júnior    Maria     120
2   Pleno    Pedro     340
3   Pleno      Ana     124
4  Sênior   Carlos     243
5  Sênior  Mariana     350

In [29]:
grupo=desempenho.groupby('Classe')
grupo.sum()

/var/folders/y0/jh438xjx6d5b9stld25sfcwr0000gn/T/ipykernel_1137/4217504767.py:2: FutureWarning: The default value of numeric_only in DataFrameGroupBy.sum is deprecated. In a future version, numeric_only will default to False. Either specify numeric_only or select only columns which should be valid for the function.
  grupo.sum()

        Vendas
Classe
Pleno      464
Sênior     593
júnior     320